Tekla Open API Reference for Tekla Structures 2025
RebarGeometry Properties
The RebarGeometry type exposes the following members.
Properties
Name | Description
BendingRadiuses
The bending radiuses of the wire.
Diameter
The diameter of the wire.
Shape
The physical points of the reinforcing bar.
Top
See Also
Reference
RebarGeometry Class
Tekla.Structures.Model Namespace